[
  {
    "id": "universities-act-16-1978",
    "title": "Universities Act 16 1978",
    "summary": "The document is the Universities (Amendment) Act, No. 7 of 1985, which amends the Universities Act, No. 16 of 1978. The amendments involve changes to the composition and powers of the University Grants Commission, regulations regarding University Councils and Senates, and other administrative and financial aspects of higher education in Sri Lanka.",
    "category": "Education",
    "sub_category": "Higher Education",
    "entities_count": 7,
    "timestamp": "2026-01-18T04:07:56.963901",
    "full_content": {
      "summary": "The document is the Universities (Amendment) Act, No. 7 of 1985, which amends the Universities Act, No. 16 of 1978. The amendments involve changes to the composition and powers of the University Grants Commission, regulations regarding University Councils and Senates, and other administrative and financial aspects of higher education in Sri Lanka.",
      "referenced_acts": [
        "Universities Act, No. 16 of 1978",
        "Employees' Provident Fund Act, No. 15 of 1958",
        "Trusts Ordinance",
        "Administration of Justice Law, No. 44 of 1973",
        "University of Ceylon Act, No. 1 of 1972",
        "Higher Education Act, No. 20 of 1966",
        "Government Quarters (Recovery of Possession) Act, No. 7 of 1969",
        "State Industrial Corporations Act, No. 49 of 1957",
        "State Lands (Recovery of Possession) Act, No. 7 ot 1979",
        "Bribery Act",
        "Penal Code"
      ],
      "sections": [
        {
          "section_number": "1",
          "content": "This Act may be cited as the Universities (Amendment) Act, No. 7 of 1935, and shall come into operation in respect of all or any of its provisions on such date or dates as the Minister may appoint by Order published in the Gazette.",
          "footnotes": [
            "Short title and date of operation."
          ]
        },
        {
          "section_number": "2",
          "content": "Section 4 of the Universities Act, No. 16 of 1978 (hereinafter referred to as the \"principal enactment\") is hereby amended by the repeal of subsection (1) of that section and the substitution therefor, of the following subsection:\n\n\"(1) The Commission shall consist of a Chairman, a Vice-Chairman and five other members, all of whom shall be appointed by the President.\".",
          "footnotes": [
            "Amendment of section 4 of Act No. 16 of 1978."
          ]
        },
        {
          "section_number": "3",
          "content": "Section 5 of the principal enactment is hereby amended as follows:\n(1) by the substitution, in subsection (1) of that section, for the words \"including the Chairman, shall\", of the words \"including the Chairman and the Vice-Chairman, shall, \";\n(2) by the substitution, in subsection (3) of that section-\n(a) for the words \"If the Chairman, on other\", of the words \"If the Chairman, Vice-Chairman, or other\", and\n(b) for the words \"such Chairman, or a fit person\", of the words \"such Chtirman or Vice-Chairman, or a fit person\"; and\n(3) by the substiution, in subsection (4) of that section, for the words \"The Chairman and other members\", of the words \"The Chairman, Vice-Chairman and other members\".",
          "footnotes": [
            "Amendment of section 5 of the principal enactment."
          ]
        },
        {
          "section_number": "4",
          "content": "Section 6 of the principal enactment is hereby amended by the repeal of subsections (1) and (2) of that section and the substitution therefor, of the following subsections :-\n\n\"(1) The Chairman of the Commission shall preside at all meetings of the Commission. In the absence of the Chairman from any meeting of the Commission, the Vice-Chairman shall preside at such meeting.\"",
          "footnotes": [
            "Amendment of section 6 of the principal enactment."
          ]
        },
        {
          "section_number": "5",
          "content": "Section 7 of the principal enactment is hereby amended as follows:-\n(1) by the repeal of subsection (1) of that section and the substitution therefor, of the following subsection:-\n\n\"(1) The Cuirman shall be the chief executive officer and the Accounting Officer of the Commission.\";\n(2) by the substitution, in subsection (3) of that section, for the expression \"under sections 15, 16 and 18\", of the expression \"under sections 16 and 18\".;\n(3) by the substitution, in subsection (4) of that section, for the words \"the Camirman shall be subject\" of the words \"the Chairman and the Vice-Chairman shall be subject\"; and\n(4) by the substitution, for the marginal note to that section, of the following marginal note :-\n\"Chairman and Vice-Chairman of the Commission. \".",
          "footnotes": [
            "Amendment of section 7 of the principal enactment,"
          ]
        },
        {
          "section_number": "6",
          "content": "Section 8 of the principal enactment is hereby amended as follows:-\n(1) by the substitution, for paragraph (a) of subsection (1) of that section, of the following paragraph :-\n\"(a) a Secretary, who shall be responsible for the custody of the records and the property of the Commission, and shall also be the Assistant Accounting Officer of the Commission; and\";\n(2) by the remumbering of subsection (2) of that section as subsection (3) thereof ; and\n(3) by the insertion, immediately after subsection (1) of that section, of the following new subsection:-\n\n(2) The provisions of sections 74 and 75, shall, mutatis mutandis, apply to and in relation to the officers and employees of the Commission, other than those officers and employees appointed to the staff of the Commission under the provisions of subsection (5) of section 9.\".",
          "footnotes": [
            "Amendment of section 8 of the principal enactment"
          ]
        },
        {
          "section_number": "7",
          "content": "Section 9 of the principal enactment is hereby amended in subsection (5) of that section, as follows :-\n(1) by the substitution, for the words \"any officer or other employee\", of the words \"any teacher, officer or other employee\"; and\n(2) by the substitution, for the words \"that officer or employee\", of the words \"that teacher, officer or employee\".",
          "footnotes": [
            "Amendment of section 9 of the principal enactment."
          ]
        },
        {
          "section_number": "9A",
          "content": "Every holder of a post in the Commission who is dismissed or is compulsorily retired from his post or is othersiwe punished for misconduct, inefficiency or dereliction of duty, may appeal against such dismissal or retirement or other punishment to the Univer sity Services Appeals Board.",
          "footnotes": [
            "Appeal against dismissal, compulsory retirement or other punishment, by holder of post in Commission."
          ]
        },
        {
          "section_number": "9B",
          "content": "(1) The seal of the Commission shall be in the custody of the Secretary of the Commission.\n(2) The seal of the Commission may be altered in such manner as may be determined by the Commission.\n(3) The seal of the Commission shall not be affixed to any instrument or document except in the presence of the Secretary and any member of the commission, both of whom shall sign the instrument or document in token of their presence.\"",
          "footnotes": [
            "Seal of the Commission."
          ]
        },
        {
          "section_number": "15",
          "content": "Section 29 of the principal enactment is hereby amended in paragraph (1) of that section, by the substitution, for the words \"to institure Professorships\", of the words \"to recommend to the Commission the institution of Professorships\".",
          "footnotes": [
            "Amendment of section 29 of the principal enactment."
          ]
        },
        {
          "section_number": "17",
          "content": "Section 34 of the principal enactment is hereby amended as follows:\n(1) by the repeal of subsection (1) of that section and the substitution therefor, of the following subsection:-\n(1) (a) The Vice-Chancellor of a University shall be appointed for a term of three years by the President upon the recommendation of the Commission from a panel of three names recommended by the Council of that University.\n(b) The Vice-Chancellor of a University may be removed from office by the President, after consultation with the Commission.",
          "footnotes": [
            "Amendment of section 34 of the principal enactment."
          ]
        },
        {
          "section_number": "45",
          "content": "Section 86 of the principal enactment is hereby amended as follows: \n(1) by the substitution, in paragraph (b) of that section, for the words \"otherwise punished against,\" of the words \"otherwise punished for misconduct, inefficiency or dereliction of duty, against \"; and\n(2) by the substitution, in paragraph (d) of that section, for the words \"Commission or the governing authority of the Higher\", of the words \"Commission or the principal executive officer of the Higher\".",
          "footnotes": [
            "Amendment of section 86 of the principal enactment."
          ]
        }
      ],
      "amendments": [
        {
          "type": "Repeal",
          "description": "Repeals section 41, 42 and 43 of the principal enactment."
        },
        {
          "type": "Repeal",
          "description": "Repeals section 134 of the principal enactment."
        },
        {
          "type": "Repeal",
          "description": "Repeals section 113 of the principal enactment."
        },
        {
          "type": "Substitution",
          "description": "Substitutes new language related to the membership of the Commission",
          "section": "2"
        }
      ],
      "entities": [
        {
          "entity_name": "President",
          "entity_type": "Person",
          "excerpt": "all of whom shall be appointed by the President"
        },
        {
          "entity_name": "Minister",
          "entity_type": "Person",
          "excerpt": "as the Minister may appoint by Order published in the Gazette"
        },
        {
          "entity_name": "University Grants Commission",
          "entity_type": "Other",
          "excerpt": "Commission from among persons who have rendered distinguished service"
        },
        {
          "entity_name": "Secretary",
          "entity_type": "Other",
          "excerpt": "in the custody of the Secretary of the Commission"
        },
        {
          "entity_name": "University Services Appeals Board",
          "entity_type": "Other",
          "excerpt": "may appeal against such dismissal or retirement or other punishment to the Univer sity Services Appeals Board"
        },
        {
          "entity_name": "Ministry of the Minister",
          "entity_type": "Ministry",
          "excerpt": "by the consent of that officer, the Secretary to the Ministry"
        },
        {
          "entity_name": "Local Government",
          "entity_type": "Other",
          "excerpt": "in consultation with the Minister in charge of the subject of Local Government"
        }
      ],
      "category": "Education",
      "sub_category": "Higher Education",
      "meeting_details": [],
      "board_members": []
    }
  },
  {
    "id": "2025-12-26-2025-12-26-26-2025-en",
    "title": "2025 12 26 2025 12 26 26 2025 En",
    "summary": "This Act amends the Strategic Development Projects Act, No. 14 of 2008, primarily concerning the identification, monitoring, and regulation of strategic development projects in Sri Lanka. The amendments focus on the duration of tax exemptions, criteria for project identification, ex-post monitoring, and administrative penalties for non-compliance.",
    "category": "Finance & Economy",
    "sub_category": "Investment Regulations",
    "entities_count": 4,
    "timestamp": "2026-01-18T01:40:01.042326",
    "full_content": {
      "summary": "This Act amends the Strategic Development Projects Act, No. 14 of 2008, primarily concerning the identification, monitoring, and regulation of strategic development projects in Sri Lanka. The amendments focus on the duration of tax exemptions, criteria for project identification, ex-post monitoring, and administrative penalties for non-compliance.",
      "referenced_acts": [
        "Strategic Development Projects Act, No. 14 of 2008",
        "Board of Investment of Sri Lanka Law, No. 4 of 1978",
        "Inland Revenue Act, No. 24 of 2017"
      ],
      "sections": [
        {
          "section_number": "1",
          "content": "This Act may be cited as the Strategic Development Projects (Amendment) Act, No. 26 of 2025.",
          "footnotes": []
        },
        {
          "section_number": "2",
          "content": "Section 2 of the Strategic Development Projects Act, No. 14 of 2008 (hereinafter referred to as the \"principal enactment\"), as last amended by Act, No. 12 of 2011, is hereby further amended in proviso thereof, by the substitution for the words \"twenty-five years.\", of the words “ten years.\".",
          "footnotes": [
            "Amendment of section 2 of Act, No.14 of 2008"
          ]
        },
        {
          "section_number": "3",
          "content": "Section 3 of the principal enactment is hereby repealed and the following section is substituted therefor: - \"Identification of Strategic Development Project 3. (1) The Board of Investment of Sri Lanka shall, subject to the criteria as may be prescribed, identify any proposed project as a Strategic Development Project.\n(2) Upon being identified the proposed project as a Strategic Development Project, the Board of Investment of Sri Lanka shall refer such project proposal to the Ministry of Finance for ex-ante cost-benefit analysis.\n(3) The Ministry of Finance shall, with the technical input from the Board of Investment of Sri Lanka, carry out such ex-ante cost- benefit analysis of the project and submit a recommendation to the Board of Investment of Sri Lanka within one month from the date of such reference under subsection (2).",
          "footnotes": [
            "Replacement of section 3 of the principal enactment"
          ]
        },
        {
          "section_number": "4",
          "content": "(4) The Board of Investment of Sri Lanka shall, upon being satisfied that such a project meets the eligibility criteria as prescribed under subsection (1) and having regard to the recommendation made under subsection (3), grant such number of years of tax holiday and any exemption or concession as may be prescribed.\n(5) Upon the identification of a project as a Strategic Development Project under this section, the Board of Investment of Sri Lanka shall communicate such decision to the Minister.\n(6) The Minister shall, with the concurrence of the Cabinet of Ministers, publish an Order in the Gazette, specifying –\n(a) the name and nature of the Strategic Development Project;\n(b) the date on which the exemptions from the enactments specified in the Schedule hereto, granted in terms of section 2, shall become operative in respect of that project; and\n(c) any other necessary information as he deems appropriate.\n(7) Such Order made under subsection (6), shall be placed before Parliament for information.\".",
          "footnotes": []
        },
        {
          "section_number": "4",
          "content": "Section 4 of the principal enactment is hereby repealed and the following sections are substituted therefor: -",
          "footnotes": [
            "Replacement of section 4 of the principal enactment"
          ]
        },
        {
          "section_number": "4. (1)",
          "content": "The Board of Investment of Sri Lanka shall, from time to time as it deems appropriate, carry out ex-post monitoring in respect of any Strategic Development Project and submit a report to the Ministry of Finance.",
          "footnotes": [
            "Ex-post monitoring of Strategic Development Project"
          ]
        },
        {
          "section_number": "4.(2)",
          "content": "The Ministry of Finance shall disclose the project outcomes and fiscal impacts of the project to the public by publication of the report submitted under subsection (1) on its official website.",
          "footnotes": []
        },
        {
          "section_number": "4.(3)",
          "content": "Where any Strategic Development Project fails to comply with the approved key performance indicators, the Board of Investment of Sri Lanka shall issue a notice of non-compliance to the Strategic Development Project Entity, which shall include-\n(a) the nature of the non-compliance; and\n(b) a specified period of time for corrective action.",
          "footnotes": []
        },
        {
          "section_number": "4.(4)",
          "content": "Where any Strategic Development Project fails to take corrective action within the period of time specified by the Board of Investment of Sri Lanka, the Board of Investment of Sri Lanka may, in consultation with the Ministry of Finance, and having regard to the nature and gravity of the non- compliance, take one or more of the following actions:-\n(a) restrict, suspend or revoke any or all exemptions, concessions or tax holiday granted under this Act in respect of the Strategic Development Project; or",
          "footnotes": []
        },
        {
          "section_number": "4A. (1)",
          "content": "The Board of Investment of Sri Lanka shall, before taking action specified in paragraph (a) or (b) of subsection (4) of section 4, issue a notice in writing to the Strategic Development Project Entity, specifying the grounds for the action.",
          "footnotes": [
            "Notice to show cause"
          ]
        },
        {
          "section_number": "4A. (2)",
          "content": "A notice under subsection (1) shall require the Strategic Development Project Entity to show cause within a period of one month from the date of receipt of the notice, as to why the sanctions specified in paragraph (a) or (b) of subsection (4) of section 4 shall not be imposed.",
          "footnotes": []
        },
        {
          "section_number": "4A. (3)",
          "content": "The Strategic Development Project Entity shall be afforded a reasonable opportunity to be heard, either in person or through an authorised representative, before a final decision is made.",
          "footnotes": []
        },
        {
          "section_number": "4A. (4)",
          "content": "Upon the consideration of any representations made by the Strategic Development Project Entity or its representative, the Board of Investment of Sri Lanka may, for the reasons to be recorded in writing, restrict, suspend, or revoke any or all exemptions, concessions or tax holiday granted under this Act in respect of the Strategic Development Project or impose administrative penalties to recover the loss incurred in that connection.",
          "footnotes": []
        },
        {
          "section_number": "4B",
          "content": "Notwithstanding the provisions of section 2 –\n(a) every Strategic Development Project Entity shall file tax returns",
          "footnotes": [
            "Liability to pay the tax"
          ]
        },
        {
          "section_number": "4c. (1)",
          "content": "The tax holiday period applicable to a Strategic Development Project shall commence on the date of commencement of commercial operations of such project, as certified by the Board of Investment of Sri Lanka.",
          "footnotes": [
            "Commencement of the tax holiday period"
          ]
        },
        {
          "section_number": "4c. (2)",
          "content": "The tax holiday period granted to a Strategic Development Project under this Act shall not be extended under any circumstances.",
          "footnotes": []
        },
        {
          "section_number": "4D",
          "content": "The Ministry of Finance shall, in respect of each financial year, publish on its official website an annual report on tax expenditures relating to all Strategic Development Projects under this Act.",
          "footnotes": [
            "Annual report of tax expenditures for the Strategic Development Project"
          ]
        },
        {
          "section_number": "4E",
          "content": "The Ministry of Finance may, in consultation with the Board of Investment of Sri Lanka, review the continued relevance and efficiency of the exemptions, concessions or tax holiday granted under this Act, upon the expiry of five years from the date of commencement of this section.",
          "footnotes": [
            "Review"
          ]
        },
        {
          "section_number": "4F. (1)",
          "content": "The Minister may make regulations in respect of matters for which regulations are authorized or required to be made or to be prescribed by this Act.",
          "footnotes": [
            "Regulations"
          ]
        },
        {
          "section_number": "4F. (2)",
          "content": "Every regulation made by the Minister shall be published in the Gazette and shall come into operation on the date of such publication or on such later date as may be specified in such regulation.",
          "footnotes": []
        },
        {
          "section_number": "4F. (3)",
          "content": "Every regulation made by the Minister, shall within a period of three months after its publication in the Gazette, be brought before Parliament for approval. Any regulation which is not so approved, shall be deemed to be rescinded as from the date of such disapproval, but without prejudice to anything duly done thereunder.",
          "footnotes": []
        },
        {
          "section_number": "4F. (4)",
          "content": "A Notification of the date of disapproval shall be published in the Gazette.",
          "footnotes": []
        },
        {
          "section_number": "5",
          "content": "Section 6 of the principal enactment is hereby repealed and the following section is substituted therefor: -",
          "footnotes": [
            "Replacement of section 6 of the principal enactment"
          ]
        },
        {
          "section_number": "6",
          "content": "In this Act, unless the context otherwise requires \"Board of Investment of Sri Lanka\" means, the Board of Investment of Sri Lanka, established under the provisions of the Board of Investment of Sri Lanka Law, No. 4 of 1978; \"Minister\" means, the Minister assigned the subject of Investment under Article 44 or 45 of the Constitution; and \"Strategic Development Project Entity\" means an enterprise with which the Board of Investment of Sri Lanka has entered into an agreement under the Board of Investment of Sri Lanka Law, No. 4 of 1978 and identified as a Strategic Development Project, under Section 3 of this Act.\".",
          "footnotes": [
            "Interpretation"
          ]
        },
        {
          "section_number": "6",
          "content": "For the avoidance of doubt, it is hereby declared that any tax holiday, exemptions and concessions or other benefit lawfully granted to a Strategic Development Project prior to the coming into operation of this Amendment Act shall, subject to compliance with the terms and conditions attached thereto, continue to be valid for the duration specified therein.",
          "footnotes": [
            "Avoidance of doubt."
          ]
        },
        {
          "section_number": "7",
          "content": "In the event of any inconsistency between the Sinhala and Tamil texts of this Act, the Sinhala text shall prevail.",
          "footnotes": [
            "Sinhala text to prevail in case of inconsistency"
          ]
        }
      ],
      "amendments": [
        {
          "type": "Substitution",
          "section": "2",
          "description": "Substitution of 'twenty-five years' with 'ten years' regarding the proviso in Section 2 of the principal act."
        },
        {
          "type": "Repeal & Substitution",
          "section": "3",
          "description": "Repealing and substituting section 3 of the principal enactment, relating to the identification of strategic development projects and the role of the Board of Investment and Ministry of Finance."
        },
        {
          "type": "Repeal & Substitution",
          "section": "4",
          "description": "Repealing and substituting section 4 of the principal enactment with updated clauses concerning ex-post monitoring, non-compliance, and procedures for corrective action."
        },
        {
          "type": "Repeal & Substitution",
          "section": "6",
          "description": "Repealing and substituting section 6 of the principal enactment, providing updated definitions of 'Board of Investment of Sri Lanka', 'Minister' and 'Strategic Development Project Entity'."
        }
      ],
      "entities": [
        {
          "entity_name": "Parliament of the Democratic Socialist Republic of Sri Lanka",
          "entity_type": "Other",
          "excerpt": "BE it enacted by the Parliament of the Democratic Socialist Republic of Sri Lanka as follows:-"
        },
        {
          "entity_name": "Board of Investment of Sri Lanka",
          "entity_type": "Institute",
          "excerpt": "The Board of Investment of Sri Lanka shall, subject to the criteria as may be prescribed, identify any proposed project as a Strategic Development Project."
        },
        {
          "entity_name": "Ministry of Finance",
          "entity_type": "Ministry",
          "excerpt": "The Ministry of Finance shall, with the technical input from the Board of Investment of Sri Lanka, carry out such ex-ante cost- benefit analysis of the project and submit a recommendation to the Board of Investment of Sri Lanka within one month from the date of such reference under subsection (2)."
        },
        {
          "entity_name": "Strategic Development Project Entity",
          "entity_type": "Other",
          "excerpt": "Where any Strategic Development Project fails to comply with the approved key performance indicators, the Board of Investment of Sri Lanka shall issue a notice of non-compliance to the Strategic Development Project Entity, which shall include-"
        }
      ],
      "category": "Finance & Economy",
      "sub_category": "Investment Regulations",
      "meeting_details": [],
      "board_members": []
    }
  },
  {
    "id": "1981-03-05-1981-03-05-13-1981-en",
    "title": "1981 03 05 1981 03 05 13 1981 En",
    "summary": "This Act provides for the establishment of the National Health Development Fund in Sri Lanka to support the development and promotion of health-care services, research, disease prevention, and the purchase of medical equipment and essential drugs.",
    "category": "Health & Safety",
    "sub_category": "Healthcare Financing",
    "entities_count": 12,
    "timestamp": "2026-01-18T23:26:21.373282",
    "full_content": {
      "summary": "This Act provides for the establishment of the National Health Development Fund in Sri Lanka to support the development and promotion of health-care services, research, disease prevention, and the purchase of medical equipment and essential drugs.",
      "referenced_acts": [
        "Inland Revenue Act, No. 28 of 1979",
        "Bribery Act"
      ],
      "sections": [
        {
          "section_number": "1",
          "content": "This Act may be cited as the National Health Development Fund Act, No. 13 of 1981.",
          "footnotes": [
            "Short title."
          ]
        },
        {
          "section_number": "2(1)",
          "content": "There shall be established a Fund to be called the \"National Health Development Fund\" (hereinafter referred to as \"the Fund\").",
          "footnotes": [
            "Establishment of the National Health Development Fund."
          ]
        },
        {
          "section_number": "2(2)",
          "content": "The Fund shall, by the name assigned to it by sub-section (1), be a body corporate, and shall have perpetual succession and a common seal and may sue and be sued in such name.",
          "footnotes": []
        },
        {
          "section_number": "3(1)",
          "content": "The administration, management and control of the Fund shall be vested in a Board of Trustees constituted as hereinafter provided.",
          "footnotes": [
            "Board of Trustees of the Fund."
          ]
        },
        {
          "section_number": "3(2)",
          "content": "The Board of Trustees of the Fund (hereinafter referred to as \"the Board\") shall consist of-\n(a) the Secretary of the Ministry of the Minister;\n(b) the Director of Health Services of the Department of Health;\n(c) the Commissioner of Ayurveda of the Department of Ayurveda ;\n(d) the Chief Accountant of the Ministry of the Minister; and\n(e) three other members appointed by the Minister each of whom shall, subject to the provisions of sub-sections (4), (5) and (6), hold office for such period as may be specified in the letter of appointment issued to him, by the Minister.",
          "footnotes": []
        },
        {
          "section_number": "3(3)",
          "content": "The Secretary of the Ministry of the Minister shall be the Chairman of the Board (hereinafter referred to as \"the Chairman \").",
          "footnotes": []
        },
        {
          "section_number": "3(4)",
          "content": "The Minister may, if he thinks it expedient to do so, remove any appointed member of the Board from office without assigning any reason therefor.",
          "footnotes": []
        },
        {
          "section_number": "3(5)",
          "content": "A member of the Board, who has been removed from office under the provisions of subsection (4), shall not be eligible for re-appointment as a member of the Board or to serve the Board in any other capacity.",
          "footnotes": []
        },
        {
          "section_number": "3(6)",
          "content": "An appointed member of the Board may at any time resign his office by written communication addressed to the Minister.",
          "footnotes": []
        },
        {
          "section_number": "3(7)",
          "content": "If the Chairman or any member of the Board is temporarily unable to discharge the duties of his office on account of ill-health or absence from Sri Lanka or any other cause, the Minister may appoint another person to act in his place.",
          "footnotes": []
        },
        {
          "section_number": "3(8)",
          "content": "If an appointed member of the Board vacates his office by death, resignation or removal, prior to the expiration of his term of office, his successor shall, unless such successor vacates his office earlier, hold office for the un-expired portion of the term of office of the person whom he succeeds.",
          "footnotes": []
        },
        {
          "section_number": "3(9)",
          "content": "No act or proceeding of the Board shall be deemed to be invalid by reason only of the existence of any vacancy amongst its members or any defect in the appointment of a member thereof.",
          "footnotes": []
        },
        {
          "section_number": "3(10)",
          "content": "The Board may make rules to regulate the procedure in regard to its meetings and the transaction of business at such meetings.",
          "footnotes": []
        },
        {
          "section_number": "4",
          "content": "An appointed member of the Board shall be remunerated in such manner and at such rates as may be determined by the Minister.",
          "footnotes": [
            "Remuneration of appointed members of the Board."
          ]
        },
        {
          "section_number": "5",
          "content": "The Board shall, in the name of the Fund, have the power to-\n(a) acquire, hold or manage property, whether movable or immovable;\n(b) sell, mortgage, exchange or otherwise dispose of, or deal with, any property, whether movable or immovable, to which the Fund may become entitled;\n(c) perform all such acts or things as may be necessary to give effect to the provisions of this Act.",
          "footnotes": [
            "Powers of the Fund."
          ]
        },
        {
          "section_number": "6",
          "content": "There shall be credited to the account of the Fund all moneys received by way of gift or donation, from private individuals, firms and institutions in Sri Lanka and abroad, for any of the purposes set out in section 7.",
          "footnotes": [
            "Payments to the Fund."
          ]
        },
        {
          "section_number": "7",
          "content": "It shall be the duty of the Board, subject to the directions of the Minister, to apply the moneys belonging to the Fund for any of the following purposes: -\n(a) the development and promotion of institutions providing health-care services in Sri Lanka ;\n(b) the promotion of research among, and the advancement of the education or knowledge of, persons engaged in or associated with the health-care services of Sri Lanka;\n(c) to finance any project for the purpose of taking necessary steps for the prevention of disease among, or protection of the health of, the people of Sri Lanka, ensuring so however that where any donation is received for the purpose of financing a particular project, such donation is, as far as practicable, utilized to finance that particular project;\n(d) the purchase of medical equipment and essential drugs used for the purposes of health-care services in Sri Lanka.",
          "footnotes": [
            "Purposes for which the moneys of the Fund may be applied."
          ]
        },
        {
          "section_number": "8",
          "content": "Any moneys belonging to the Fund may be invested by the Board in such manner as the Board may determine, subject to such directions as may be given by the Minister.",
          "footnotes": [
            "Investment of moneys of the Fund."
          ]
        },
        {
          "section_number": "9",
          "content": "The Board shall have the power, subject to the directions of the Minister-\n(a) to appoint such officers and servants of the Fund as may be necessary for the administration and management of the affairs of the Fund;\n(b) to determine the remuneration payable to the officers and servants so appointed;\n(c) to pay such remuneration and other expenses incurred in the administration of the affairs of the Fund, out of the income of the Fund.",
          "footnotes": [
            "Officers and servants of the Fund."
          ]
        },
        {
          "section_number": "10(1)",
          "content": "The Board shall cause proper books of accounts to be kept of the income and expenditure of the Fund.",
          "footnotes": [
            "Accounts and audit."
          ]
        },
        {
          "section_number": "10(2)",
          "content": "The Auditor-General shall audit the accounts of the Fund every year. For the purpose of assisting him in the audit of such accounts, the Auditor-General may employ the services of any qualified auditor who shall act under his direction and control.",
          "footnotes": []
        },
        {
          "section_number": "10(3)",
          "content": "For the purpose of meeting the expenses incurred by him in the audit of the accounts of the Fund, the Auditor-General shall be paid out of the income of the Fund, such remuneration as the Board may determine. Any remuneration received from the Fund by the Auditor-General shall, after the deduction therefrom of any sums paid by him to any qualified auditor or auditors employed by him for the purpose of such audit, be credited to the Consolidated Fund.",
          "footnotes": []
        },
        {
          "section_number": "10(4)",
          "content": "The Auditor-General shall, as soon as practicable after the thirty-first day of December of each year, prepare a report on the administration of the affairs of the Fund during that year, together with a statement of the income and expenditure of the Fund, and of the investment of the moneys belonging to the Fund, during that year.",
          "footnotes": []
        },
        {
          "section_number": "10(5)",
          "content": "In this section, the expression \"qualified auditor \" means-\n(a) an individual who, being a member of the Institute of Chartered Accountants of Sri Lanka or any other Institute established by law, possesses a certificate to practise as an Accountant, issued by the Council of such Institute; or\n(b) a firm of Chartered Accountants each of the resident parteners of which, being a member of the Institute of Chartered Accountants of Sri Lanka or of any other Institute established by law, possesses a certificate to practise as an Accountant issued by the Council of such Institute.",
          "footnotes": []
        },
        {
          "section_number": "11",
          "content": "The Auditor-General shall transmit the report and statement prepared by him in pursuance of the provisions of subsection (4) of section 10 to the Minister who shall cause such report and statment to be placed before Parliament.",
          "footnotes": [
            "Auditor-General's report and statement to be placed before Parliament."
          ]
        },
        {
          "section_number": "12",
          "content": "The financial year for the purpose of the Fund shall be the year commencing on the first day of January and ending on the thirty-first day of December.",
          "footnotes": [
            "Financial year."
          ]
        },
        {
          "section_number": "13(1)",
          "content": "The Minister may with the concurrence of the Minister in charge of the subject of Finance, exempt the Fund from the payment of any customs duty on any goods imported by the Fund, if the import of such goods is considered to be conducive for the advancement of the purposes of the Fund.",
          "footnotes": [
            "Exemption of Fund from certain dues and taxes."
          ]
        },
        {
          "section_number": "13(2)",
          "content": "The Fund shall be exempt from any income tax or wealth tax payable under the Inland Revenue Act, No. 28 of 1979.",
          "footnotes": []
        },
        {
          "section_number": "13(3)",
          "content": "Where any person makes a gift to the Fund, he shall be exempt from the payment of gifts tax under the Inland Revenue Act, No. 28 of 1979, to the extent of the total value of the gift.",
          "footnotes": []
        },
        {
          "section_number": "13(4)",
          "content": "Where any person makes a donation to the Fund, such donation shall be deemed to be an approved expenditure for the purposes of the Inland Revenue Act, No. 28 of 1979, and the donor shall be entitled to relief under that Act in respect of the total value of such donation.",
          "footnotes": []
        },
        {
          "section_number": "13(5)",
          "content": "The provisions of this section shall have effect notwithstanding anything to the contrary in the Inland Revenue Act, No. 28 of 1979.",
          "footnotes": []
        },
        {
          "section_number": "14",
          "content": "All officers and servants of the Fund shall be deemed to be public servants within the meaning, and for the purposes, of the Penal Code.",
          "footnotes": [
            "Officers and servants of the Fund deemed to be public servants within the meaning of the Penal Code."
          ]
        },
        {
          "section_number": "15",
          "content": "The Fund shall be deemed to be a scheduled institution within the meaning of the Bribery Act and the provisions of that Act shall accordingly apply.",
          "footnotes": [
            "Fund to be a scheduled institution within the meaning of the Bribery Act."
          ]
        }
      ],
      "amendments": [],
      "entities": [
        {
          "entity_name": "National Health Development Fund",
          "entity_type": "Other",
          "excerpt": "This Act may be cited as the National Health Development Fund Act, No. 13 of 1981."
        },
        {
          "entity_name": "Board of Trustees",
          "entity_type": "Other",
          "excerpt": "The administration, management and control of the Fund shall be vested in a Board of Trustees constituted as hereinafter provided."
        },
        {
          "entity_name": "Ministry of the Minister",
          "entity_type": "Ministry",
          "excerpt": "the Secretary of the Ministry of the Minister"
        },
        {
          "entity_name": "Department of Health",
          "entity_type": "Department",
          "excerpt": "the Director of Health Services of the Department of Health"
        },
        {
          "entity_name": "Commissioner of Ayurveda of the Department of Ayurveda",
          "entity_type": "Person",
          "excerpt": "the Commissioner of Ayurveda of the Department of Ayurveda"
        },
        {
          "entity_name": "Chief Accountant of the Ministry of the Minister",
          "entity_type": "Person",
          "excerpt": "the Chief Accountant of the Ministry of the Minister"
        },
        {
          "entity_name": "Minister",
          "entity_type": "Person",
          "excerpt": "three other members appointed by the Minister"
        },
        {
          "entity_name": "Government Printing",
          "entity_type": "Department",
          "excerpt": "PRINTED AT THE DEPARTMENT OF GOVERNMENT PRINTING, SRI LANKA"
        },
        {
          "entity_name": "Government Publications Bureau",
          "entity_type": "Department",
          "excerpt": "TO BE PURCHASED AT THE GOVT. PUBLICATIONS BUREAU, COLOMBO"
        },
        {
          "entity_name": "Auditor-General",
          "entity_type": "Person",
          "excerpt": "The Auditor-General shall audit the accounts of the Fund every year."
        },
        {
          "entity_name": "Institute of Chartered Accountants of Sri Lanka",
          "entity_type": "Institute",
          "excerpt": "an individual who, being a member of the Institute of Chartered Accountants of Sri Lanka"
        },
        {
          "entity_name": "Minister in charge of the subject of Finance",
          "entity_type": "Person",
          "excerpt": "The Minister may with the concurrence of the Minister in charge of the subject of Finance"
        }
      ],
      "category": "Health & Safety",
      "sub_category": "Healthcare Financing",
      "meeting_details": [],
      "board_members": [
        {
          "role_name": "Chairman",
          "appointing_authority": "N/A",
          "removal_criteria": "Temporarily unable to discharge the duties of his office on account of ill-health or absence from Sri Lanka or any other cause",
          "composition_criteria": "Secretary of the Ministry of the Minister",
          "excerpt": "The Secretary of the Ministry of the Minister shall be the Chairman of the Board (hereinafter referred to as \"the Chairman \")."
        },
        {
          "role_name": "Member",
          "appointing_authority": "Minister",
          "removal_criteria": "The Minister may, if he thinks it expedient to do so, remove any appointed member of the Board from office without assigning any reason therefor.",
          "composition_criteria": "N/A",
          "excerpt": "three other members appointed by the Minister"
        },
        {
          "role_name": "Secretary of the Ministry of the Minister",
          "appointing_authority": "N/A",
          "removal_criteria": "N/A",
          "composition_criteria": "N/A",
          "excerpt": "the Secretary of the Ministry of the Minister;"
        },
        {
          "role_name": "Director of Health Services",
          "appointing_authority": "N/A",
          "removal_criteria": "N/A",
          "composition_criteria": "N/A",
          "excerpt": "the Director of Health Services of the Department of Health;"
        },
        {
          "role_name": "Commissioner of Ayurveda",
          "appointing_authority": "N/A",
          "removal_criteria": "N/A",
          "composition_criteria": "N/A",
          "excerpt": "the Commissioner of Ayurveda of the Department of Ayurveda ;"
        },
        {
          "role_name": "Chief Accountant of the Ministry of the Minister",
          "appointing_authority": "N/A",
          "removal_criteria": "N/A",
          "composition_criteria": "N/A",
          "excerpt": "the Chief Accountant of the Ministry of the Minister;"
        }
      ]
    }
  }
]