{
    "minister_of_education": {
        "duties_and_functions": [
            "1. Formulation, implementation, monitoring and evaluation of policies, programmes and projects, in relation to the subject of education, and those subjects that come under the purview of Departments, Statutory Institutions and Public Corporations listed in Column II based on the national policies implemented by the government. [cite: 155]",
            "2. Provision of public services under the purview of the Ministry in an efficient and people friendly manner [cite: 155]",
            "3. Reforming all systems and procedures using modern management techniques and technology, thus ensuring that the functions of the Ministry are fulfilled while eliminating corruption and waste. [cite: 155]",
            "4. Formulation and implementation of sectoral policies relating to education development so as to ensure good rapport between early childhood, primary, secondary and tertiary divisions [cite: 155]",
            "5. Creation of National Education System that will enable Sri Lankan children and youth to access global challenges with self-confidence and success. [cite: 162]",
            "6. Provision of policy guidance for the preparation of a clear road map from pre-school education to the completion of higher education [cite: 162]",
            "7. Ensuring the right of every child to access education [cite: 162]",
            "8. Popularize extracurricular activities in schools [cite: 162]",
            "9. Provision of physical and human resources needed for National Schools [cite: 162]",
            "10. Regulation of international and private schools in conformity with the national education policy [cite: 162]",
            "11. Take policy measures for proper maintenance of quality of education, student discipline and morals. [cite: 162]",
            "12. Adoption of measures to ensure education opportunities for students with special needs [cite: 162]",
            "13. Take necessary actions to promote national language and link language education [cite: 162]",
            "14. Promotion of Buddhist and Pali Studies and upliftment of Piriven education to meet the objectives of religious education [cite: 162]",
            "15. Human resources management and administration of the Sri Lanka Education Administrative Service, Principal Service, Teachers Service and other educational services [cite: 162, 168]",
            "16. Administration of School Development Boards [cite: 168]",
            "17. Promotion and Development of school libraries [cite: 168]",
            "18. Implementation and direction of programmes for the provision of school text books, uniforms, other student necessities and facilities. [cite: 168]",
            "19. Development of all physical facilities including sanitary facilities, student-friendly classrooms, teachers' residential and restroom facilities in all schools. [cite: 168]",
            "20. Development and promotion of the use of modern technological facilities for learning and teaching [cite: 168]",
            "21. Formulation and implementation of strategies to enhance the trend towards vocational education [cite: 168]",
            "22. Creation of opportunities to acquire vocational education disregarding educational qualifications [cite: 168]",
            "23. Modernization of industrial and technical education for the purpose of creating a workforce suitable for the local and foreign employment market [cite: 168]",
            "24. Modernize curricula, network all such institutions under \"One TVET\" concept and transform them into Technology Degree Awarding institutions. [cite: 168]",
            "25. Formulation of policies and provision of facilities to enable students who do not qualify to enter university education after leaving school to broaden their opportunities for vocational education. [cite: 174]",
            "26. Promotion of apprenticeship training opportunities. [cite: 174]",
            "27. Increase the National Vocational Qualification level from current 7 to 10 and amend the Sri Lanka Qualification Framework accordingly. [cite: 174]",
            "28. Amend vocational training curricula to incorporate subjects such as Entrepreneurship, Information Technology, English and other languages into vocational education courses. [cite: 174]",
            "29. Expand vocational training opportunities through the use of mobile technical education services. [cite: 174]",
            "30. Take necessary measures to provide vocational education targeting local and foreign job markets. [cite: 174]",
            "31. Commence City Universities as higher education institutions granting degrees compatible with job opportunities. [cite: 174]",
            "32. Facilitate research institutions to collaborate with international research institutions [cite: 174]",
            "33. Formulate an efficient mechanism to utilize innovations and outcomes of research [cite: 174]",
            "34. Take steps to establish the National Innovation Agency [cite: 179]",
            "35. Take steps to expand scientific, industrial, social and economic research and development activities [cite: 179]",
            "36. Motivate and direct communities towards innovation. [cite: 179]",
            "37. Management and development of State Universities under the administration of the University Grants Commission [cite: 179]",
            "38. Affiliation and promotion of cooperation with international academic institutions and other organizations with the objective of improving the quality of higher education in Sri Lanka [cite: 179]",
            "39. Identification and adoption of appropriate criteria in broadening avenues for higher education [cite: 179]",
            "40. Revise curricula within overall Education Reforms Policy to create graduates targeting domestic and foreign job markets. [cite: 179]",
            "41. Facilitating and encouraging research and innovation in university education [cite: 179]",
            "42. Taking measures to establish Smart Learning Universities [cite: 179]",
            "43. Taking steps to upgrade all state universities to a high position in world rankings [cite: 179]",
            "44. Implementation of scholarship programmess to enable qualified students in Sri Lanka to gain entrance to international universities [cite: 179, 186]",
            "45. Regulate and accredit private and international universities and institutions of higher education operating in Sri Lanka [cite: 186]",
            "46. Uplifting Buddhist and Pali studies and provision of facilities required for higher education of Bhikkus [cite: 186]",
            "47. Introduction of educational reforms to cover the overall education sector in line with global requirements [cite: 186]",
            "48. Formulate a programme for utilizing the recommendations of the Presidential Task Force on Education Reforms and Special Committees for the development of education subsequent to a public discourse [cite: 186]",
            "49. Expansion of distance learning opportunities by using Information Technology [cite: 186]",
            "50. Training of teachers and enhancement of their skills to produce teachers required to ensure effective learning and teaching process [cite: 186]",
            "51. Matters relating to all other subjects assigned to Institutions listed in Column II [cite: 186]",
            "52. Supervision of all Institutions listed in Column II [cite: 186]"
        ],
        "departments_statutory_institutions_and_public_corporations": [
            "1. Department of Examinations [cite: 155]",
            "2. Department of Educational Publications [cite: 155]",
            "3. National Library and Documentation Services Board [cite: 155]",
            "4. National Colleges of Education [cite: 155]",
            "5. Teachers' College [cite: 155]",
            "6. UNESCO National Commission of Sri Lanka [cite: 155]",
            "7. Sri Lanka Publication Development Bureau [cite: 155]",
            "8. State Printing Corporation [cite: 155]",
            "9. Directorates of Education [cite: 155]",
            "10. National Education Commission [cite: 155]",
            "11. National Institute of Education [cite: 155]",
            "12. Piriven Education Board [cite: 155]",
            "13. National Institute of Business Management and affiliated institutions [cite: 155]",
            "14. University of Vocational Technology [cite: 155]",
            "15. National Institute of Fisheries and Nautical Engineering (Ocean University) [cite: 155]",
            "16. Vocational Training Authority of Sri Lanka [cite: 162]",
            "17. National Apprenticeship and Industrial Training Authority [cite: 162]",
            "18. Ceylon German Technical Training Institute [cite: 162]",
            "19. Department of Technical Education and Training [cite: 162]",
            "20. National Institute of Fundamental Studies [cite: 162]",
            "21. Sri Lanka Inventors' Commission [cite: 162]",
            "22. National Engineering Research And Development Centre [cite: 162]",
            "23. National Research Council [cite: 162]",
            "24. Tertiary and Vocational Education Commission [cite: 162]",
            "25. National Science Foundation [cite: 162]",
            "26. Planetarium of Sri Lanka [cite: 162]",
            "27. Arthur C. Clarke Institute for Modern Technologies [cite: 162]",
            "28. National Innovation Agency [cite: 162]",
            "29. Skills Development Fund Ltd. [cite: 162]",
            "30. Sri Lanka Inventors Fund [cite: 162]",
            "31. National Science and Technology Commission [cite: 162]",
            "32. Sri Lanka Institute of Nanotechnology (Pvt.) Ltd. [cite: 162]",
            "33. Sri Lanka Institute of Biotechnology (Pvt.) Ltd. [cite: 162]",
            "34. Vidatha Centres [cite: 162]",
            "35. University Grants Commission [cite: 162]",
            "36. All State Universities, Postgraduate Institutions and other Institutions under the purview of University Grants Commission [cite: 168]",
            "37. Buddhasravaka Bhikku University [cite: 168]",
            "38. Buddhist and Pali University of Sri Lanka [cite: 168]",
            "39. Sri Lanka Institute of Advanced Technological Education [cite: 168]"
        ],
        "laws_and_ordinance_to_be_implemented": [
            "Public Examinations Act, No. 25 of 1968 [cite: 155]",
            "Assisted Schools and Training Colleges (Special Provisions) Act, No. 5 of 1960 [cite: 155]",
            "Assisted Schools and Training Colleges (Additional Provisions) Act, No. 8 of 1961 [cite: 155]",
            "Assisted Schools and Training Colleges (Special Provisions) (Amendment) Act, No. 65 of 1981 [cite: 155]",
            "National Library and Documentation Board Act, No. 51 of 1988 [cite: 155]",
            "School Development Boards Act, No. 8 of 1993 [cite: 155]",
            "UNESCO Scholarship Fund Act, No. 44 of 1999 [cite: 155]",
            "State Printing Corporation Act, No. 24 of 1968 [cite: 155]",
            "Education Ordinance, No. 31 of 1939 [cite: 155]",
            "Colleges of Education Act, No. 30 of 1986 [cite: 155]",
            "Assisted Schools and Training Colleges Act, No. 5 of 1960 [cite: 162]",
            "National Education Commission Act, No. 19 of 1991 [cite: 162]",
            "National Institute of Education Act, No. 28 of 1985 [cite: 162]",
            "Pirivena Education Act, No. 64 of 1979 [cite: 162]",
            "University of Vocational Technology Act, No. 31 of 2008 [cite: 162]",
            "Ocean University of Sri Lanka Act, No. 31 of 2014 [cite: 162]",
            "National Institute Of Business Management Law, No. 23 of 1976 [cite: 162]",
            "Vocational Training Authority of Sri Lanka Act, No. 12 of 1995 [cite: 162]",
            "Ceylon German Technical Training Institute Act, No. 15 of 2017 [cite: 162]",
            "National Innovation Agency Act, No. 22 of 2019 [cite: 162]",
            "Science and Technology Development Act, No. 11 of 1994 [cite: 162]",
            "Sri Lanka National Research Council Act, No. 11 of 2016 [cite: 162]",
            "Sri Lanka Inventors Incentives Act, No. 53 of 1979 [cite: 162]",
            "National Institute of Technical Education of Sri Lanka Act, No. 59 of 1998 [cite: 162]",
            "State Industries Corporations Act, No. 49 of 1957 [cite: 162]",
            "Tertiary and Vocational Education Act, No. 20 of 1990 [cite: 168]",
            "Institute of Fundamental Studies, Sri Lanka Act, No. 55 of 1981 [cite: 168]",
            "Universities Act, No. 16 of 1978 [cite: 168]",
            "Buddhasravaka Bhikku University Act, No. 26 of 1996 [cite: 168]",
            "Buddhist And Pali University of Sri Lanka Act, No. 74 of 1981 [cite: 168]",
            "Sri Lanka Institute of Advanced Technological Education Act, No. 29 of 1995 [cite: 168]",
            "All other legislations pertaining to the subjects specified in Column I and II that have not been specifically brought under the purview of any other Minister. [cite: 168]"
        ]
    }
}